package Test;
//663380378-4 จุฬาราช คูณคำ

import static org.junit.jupiter.api.Assertions.*;
import org.junit.jupiter.params.ParameterizedTest;
import org.junit.jupiter.params.provider.CsvSource;

class Test_V2 {

	@ParameterizedTest
	@CsvSource({
	    "1000, 300, 500, 29000, ",
	    "1000, 300, 1750, 54000, ",
	    "1000, 300, 400, ขาดทุน",
	    "1000, 550, 500, 36500, ",
	    "1000, 550, 1750, 61500, ",
	    "1000, 550, 400,  ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "1000, 200, 500, ขาดทุน",
	    "1000, 200, 1750, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "1000, 200, 400, ขาดทุน",
	    "2500, 300, 500, 44000, ",
	    "2500, 300, 1750, 69000, ",
	    "2500, 300, 400 ,ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "2500, 550, 500, 51500, ",
	    "2500, 550, 1750, 76500, ",
	    "2500, 550, 400,  ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "2500, 200, 500, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "2500, 200, 1750, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "2500, 200, 400, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "900, 300, 500, ขาดทุน",
	    "900, 300, 1750, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "900, 300, 400, ขาดทุน",
	    "900, 550, 500, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "900, 550, 1750, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "900, 550, 400, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "900, 200, 500, ขาดทุน",
	    "900, 200, 1750, ยอดขายบางอย่างไม่ถึงเป้าแต่กำไร",
	    "900, 200, 400, ขาดทุน"
	})
    void testCalculateIncome(int numImpeller, int numMotor, int numCover, double expected) {
        Income incomeCalculator = new Income();
        assertEquals(expected, incomeCalculator.calculateIncome(numImpeller, numMotor, numCover), 0.001);
    }
}
